In [1]:
# Import Dependencies
import pandas as pd
from pathlib import Path

In [2]:
# Create a path to the csv and read it into a Pandas DataFrame
csv_path = Path("Resources/penguins_ice_time.csv")
pens_df = pd.read_csv(csv_path)

pens_df.head()

,Date,Player,Opp,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Lineup,Score_For,Score_Against,Result,Goals,Assists,Points,+/-
0,11/5/24,Rakell,NYI,24,21.77,16.57,5.20,0.0,12-6,3,4,SOL,0,2,2,0
1,11/5/24,Malkin,NYI,24,22.20,16.93,5.27,0.0,12-6,3,4,SOL,1,1,2,0
2,11/5/24,Crosby,NYI,24,21.82,16.58,5.23,0.0,12-6,3,4,SOL,1,0,1,0
3,11/2/24,Rakell,MTL,23,17.85,15.83,2.02,0.0,12-6,3,1,W,0,1,1,1
4,11/2/24,Malkin,MTL,23,19.28,16.88,2.40,0.0,12-6,3,1,W,0,0,0,1

In [3]:
# Figure out the minimum and maximum EV_TOI
print(pens_df["EV_TOI"].max())
print(pens_df["EV_TOI"].min())

20.57
8.83

In [4]:
# Create a GroupBy object based upon "Player"
player_group = pens_df.groupby("Player")

In [5]:
# Get the average of each TOI column
player_group[["Shift_Count", "Total_TOI", "EV_TOI", "PP_TOI", "SH_TOI", "Points", "+/-"]].mean()

,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Points,+/-
Player,,,,,,,
Crosby,24.529412,20.161765,17.004706,3.102941,0.070882,1.323529,-0.088235
Malkin,22.117647,18.413529,15.430000,2.969118,0.009706,1.029412,0.147059
Rakell,20.617647,15.860000,13.940882,1.919706,0.001471,0.617647,0.352941

In [6]:
# Create bins for EV_TOI
bins = [0, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]

# Create labels for these bins
group_labels = ["0 to 7.99", "8 to 8.99", "9 to 9.99", "10 to 10.99", "11 to 11.99", "12 to 12.99", "13 to 13.99", 
                "14 to 14.99", "15 to 15.99", "16 to 16.99", "17 to 17.99", "18 to 18.99", 
                "19 to 19.99", "20 to 20.99"]

In [7]:
# Slice the data and place it into bins
pd.cut(pens_df["EV_TOI"], bins, labels=group_labels)

0      16 to 16.99
1      16 to 16.99
2      16 to 16.99
3      15 to 15.99
4      16 to 16.99
          ...
97     16 to 16.99
98     19 to 19.99
99       8 to 8.99
100    15 to 15.99
101    15 to 15.99
Name: EV_TOI, Length: 102, dtype: category
Categories (14, object): ['0 to 7.99' < '8 to 8.99' < '9 to 9.99' < '10 to 10.99' ... '17 to 17.99' < '18 to 18.99' < '19 to 19.99' < '20 to 20.99']

In [8]:
# Place the data series into a new column inside of the DataFrame
pens_df["EV_TOI_group"] = pd.cut(pens_df["EV_TOI"], bins, labels=group_labels)
pens_df.head()

,Date,Player,Opp,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Lineup,Score_For,Score_Against,Result,Goals,Assists,Points,+/-,EV_TOI_group
0,11/5/24,Rakell,NYI,24,21.77,16.57,5.20,0.0,12-6,3,4,SOL,0,2,2,0,16 to 16.99
1,11/5/24,Malkin,NYI,24,22.20,16.93,5.27,0.0,12-6,3,4,SOL,1,1,2,0,16 to 16.99
2,11/5/24,Crosby,NYI,24,21.82,16.58,5.23,0.0,12-6,3,4,SOL,1,0,1,0,16 to 16.99
3,11/2/24,Rakell,MTL,23,17.85,15.83,2.02,0.0,12-6,3,1,W,0,1,1,1,15 to 15.99
4,11/2/24,Malkin,MTL,23,19.28,16.88,2.40,0.0,12-6,3,1,W,0,0,0,1,16 to 16.99

In [9]:
# Create new Dataframe containing only Rakell data
rakell_df = pens_df[pens_df['Player'].str.contains('Rakell', na=False)]
rakell_df.head()

,Date,Player,Opp,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Lineup,Score_For,Score_Against,Result,Goals,Assists,Points,+/-,EV_TOI_group
0,11/5/24,Rakell,NYI,24,21.77,16.57,5.20,0.00,12-6,3,4,SOL,0,2,2,0,16 to 16.99
3,11/2/24,Rakell,MTL,23,17.85,15.83,2.02,0.00,12-6,3,1,W,0,1,1,1,15 to 15.99
6,10/31/24,Rakell,ANA,26,22.27,18.57,3.70,0.00,12-6,2,1,OTW,0,0,0,1,18 to 18.99
9,10/29/24,Rakell,MIN,23,19.95,17.77,2.18,0.00,12-6,3,5,L,2,0,2,2,17 to 17.99
12,10/26/24,Rakell,VAN,22,19.85,17.47,2.33,0.05,12-6,3,4,L,0,1,1,-1,17 to 17.99

In [10]:
# Group by the minute by minute EV_TOI_groups
rakell_EV_TOI_group = rakell_df.groupby("EV_TOI_group", observed=False)

In [11]:
# Show stats Avgs for each EV_TOI_group
rakell_EV_TOI_group[["Shift_Count", "Total_TOI", "EV_TOI", "PP_TOI", "SH_TOI", "Points", "+/-"]].mean()

,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Points,+/-
EV_TOI_group,,,,,,,
0 to 7.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8 to 8.99,12.000000,11.7800,8.8300,2.95000,0.000,0.000000,0.000000
9 to 9.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10 to 10.99,18.750000,12.2325,10.4775,1.75250,0.000,0.500000,0.500000
11 to 11.99,18.666667,13.7200,11.7700,1.95000,0.000,0.666667,-0.333333
12 to 12.99,18.500000,15.0150,12.4650,2.55000,0.000,0.000000,-0.500000
13 to 13.99,19.800000,14.7520,13.3280,1.43600,0.000,0.600000,-0.200000
14 to 14.99,21.250000,16.2525,14.3850,1.86875,0.000,0.500000,0.250000
15 to 15.99,21.500000,16.8200,15.4825,1.34000,0.000,0.500000,2.000000
16 to 16.99,23.750000,18.5525,16.3875,2.16500,0.000,1.250000,0.250000
17 to 17.99,22.500000,19.9000,17.6200,2.25500,0.025,1.500000,0.500000
18 to 18.99,26.000000,22.2700,18.5700,3.70000,0.000,0.000000,1.000000
19 to 19.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20 to 20.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
# Create new Dataframe containing only Malkin data
malkin_df = pens_df[pens_df['Player'].str.contains('Malkin', na=False)]
malkin_df.head()

,Date,Player,Opp,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Lineup,Score_For,Score_Against,Result,Goals,Assists,Points,+/-,EV_TOI_group
1,11/5/24,Malkin,NYI,24,22.20,16.93,5.27,0.0,12-6,3,4,SOL,1,1,2,0,16 to 16.99
4,11/2/24,Malkin,MTL,23,19.28,16.88,2.40,0.0,12-6,3,1,W,0,0,0,1,16 to 16.99
7,10/31/24,Malkin,ANA,26,21.88,17.93,3.95,0.0,12-6,2,1,OTW,0,0,0,1,17 to 17.99
10,10/29/24,Malkin,MIN,23,20.07,17.80,2.17,0.1,12-6,3,5,L,0,0,0,1,17 to 17.99
13,10/26/24,Malkin,VAN,19,17.23,14.92,2.32,0.0,12-6,3,4,L,1,2,3,2,14 to 14.99

In [13]:
# Group by the minute by minute EV_TOI_groups
malkin_EV_TOI_group = malkin_df.groupby("EV_TOI_group", observed=False)

In [14]:
# Show stats Avgs for each EV_TOI_group
malkin_EV_TOI_group[["Shift_Count", "Total_TOI", "EV_TOI", "PP_TOI", "SH_TOI", "Points", "+/-"]].mean()

,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Points,+/-
EV_TOI_group,,,,,,,
0 to 7.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8 to 8.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9 to 9.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10 to 10.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11 to 11.99,20.000000,13.970000,11.53000,2.430000,0.000,1.000000,1.00
12 to 12.99,19.000000,16.325000,12.65000,3.675000,0.000,1.000000,-0.50
13 to 13.99,20.000000,17.582500,13.77750,3.765000,0.020,1.250000,0.25
14 to 14.99,21.500000,17.240000,14.44125,2.787500,0.010,0.875000,-0.25
15 to 15.99,22.400000,19.322000,15.66800,3.630000,0.014,0.800000,0.80
16 to 16.99,22.666667,18.862222,16.68000,2.182222,0.000,1.333333,0.00
17 to 17.99,24.500000,21.117500,17.60250,3.487500,0.025,1.000000,0.50
18 to 18.99,28.000000,20.350000,18.28000,2.070000,0.000,0.000000,0.00
19 to 19.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20 to 20.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
# Create new Dataframe containing only Crosby data
crosby_df = pens_df[pens_df['Player'].str.contains('Crosby', na=False)]
crosby_df.head()

,Date,Player,Opp,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Lineup,Score_For,Score_Against,Result,Goals,Assists,Points,+/-,EV_TOI_group
2,11/5/24,Crosby,NYI,24,21.82,16.58,5.23,0.00,12-6,3,4,SOL,1,0,1,0,16 to 16.99
5,11/2/24,Crosby,MTL,24,20.03,17.92,2.12,0.00,12-6,3,1,W,2,0,2,1,17 to 17.99
8,10/31/24,Crosby,ANA,27,22.52,19.20,3.50,0.00,12-6,2,1,OTW,2,0,2,2,19 to 19.99
11,10/29/24,Crosby,MIN,23,20.73,17.82,2.60,0.32,12-6,3,5,L,0,3,3,1,17 to 17.99
14,10/26/24,Crosby,VAN,23,18.77,16.35,2.33,0.08,12-6,3,4,L,0,0,0,-1,16 to 16.99

In [16]:
# Group by the minute by minute EV_TOI_groups
crosby_EV_TOI_group = crosby_df.groupby("EV_TOI_group", observed=False)

In [17]:
# Show stats Avgs for each EV_TOI_group
crosby_EV_TOI_group[["Shift_Count", "Total_TOI", "EV_TOI", "PP_TOI", "SH_TOI", "Points", "+/-"]].mean()

,Shift_Count,Total_TOI,EV_TOI,PP_TOI,SH_TOI,Points,+/-
EV_TOI_group,,,,,,,
0 to 7.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8 to 8.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9 to 9.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10 to 10.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11 to 11.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12 to 12.99,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13 to 13.99,23.000000,16.150000,13.700000,2.450000,0.000000,2.000000,-1.000000
14 to 14.99,23.000000,20.220000,14.770000,5.370000,0.080000,0.000000,0.000000
15 to 15.99,24.333333,19.745556,15.562222,4.091111,0.094444,1.222222,-0.111111
16 to 16.99,24.000000,19.970000,16.568333,3.343333,0.055000,1.333333,0.500000
17 to 17.99,24.818182,20.232727,17.566364,2.567273,0.102727,1.727273,-0.090909
18 to 18.99,23.000000,21.800000,18.970000,2.820000,0.020000,1.000000,-1.000000
19 to 19.99,25.250000,21.180000,19.362500,1.947500,0.000000,0.750000,-0.250000
20 to 20.99,28.000000,22.520000,20.570000,1.950000,0.000000,1.000000,-1.000000